/**
 * 新闻资讯-资讯详情
 *
 * @url news/noticeDetail.action?id=1
 *
 */

module.exports = ({ method, query, body }) => {
  return {
    code: 0,
    msg: '',
    info: {
      id: 3465,
      title:
        '\u4e09\u5e74\u60c5\u5b88\u201c7\u53f7\u673a\u201d \u7ec8\u63fd25\u4e07\u5143\u5168\u56fd\u7d2f\u79ef\u5956',
      date: '@date()',
      content:
        '<p style="text-indent: 2em; text-align: left;">福彩总是能给人意外惊喜，运气来时连续中奖也不是难事。湛江彩民李先生（化姓）就是这样一位幸运儿，他在一周内竟然两次中得“快乐十分”大奖，总奖金加起来达6.4万元，运气真是好的不要不要的。</p><p style="text-indent: 2em; text-align: left;">“真的没想到，能够连续中奖，心里好开心！”李先生在兑奖时说。据了解，李先生是福彩的资深彩民，自从“快乐十分”上市，他便成为快开游戏的铁杆粉丝。每次接送小孩上下学时，都会在位于学校附近的赤坎区跃进路39号44155016的福彩投注站玩下“快乐十分”。他第一次中奖的时间为2018年1月23日，当时他选择选五任选玩法，投注数为100倍，他的心水码是“03，05，07，09，11”，开奖后竟然全中，而且这串数字也很特别，全是奇数连号。第二次中奖的时间为1月26日，还是选五任选玩法，投注数还是100倍，这次他的心水码是“10，11，13，15，16”，开奖后同样是全中。每次中奖金额为3.2万元，加起来6.4万元。有位哲人说过，人不能两次踏进同一条河流，而这位李先生却在一个投注站两次踏进同一样幸运的河流，用行动来“推翻”这条格言，如果这位哲人还在世的话不知有何感想啊。</p><p style="text-indent: 2em; text-align: left;">说起选号的心得，李先生表示，主要靠运气，但自己平时也多看、多买、多思考、多研究，对每个自己感兴趣的数字都会用笔记下来，然后再根据自己的感觉进行组合投注，一般来说，不是太喜欢的号就打的倍数不是很多，如果是自己非常喜欢的号码，会选择加倍重打。李先生还说，自己喜欢买福彩出于一种爱好，在平时工作之余找点乐子，以理性心态去购彩，中奖则是意外收获。</p>',
    },
  };
};
