<template lang="pug">
  <div class="help_list">
    <div class="lis">
      <h5>{{data.label}}</h5>
      <ul>
        <li v-for="(label, idx) in tabs" :key="label" @click="tabIdx = idx" :class="{'sli': tabIdx == idx}" >{{label}}</li>
      </ul>
    </div>
    <div class="help_col" :class="{'show': tabIdx == 0}">
      <h5>
        <strong>单码/双面规则说明</strong>
      </h5>
      <p>
        <strong>◎定位</strong>
        <br> 指冠军、亚军、季军、第四、第五、第六、第七、第八、第九、第十名出现的顺序与号码为派彩依据。
        <br> 如现场第一个开奖号码为3号，投注冠军为3则视为中奖，其它号码视为不中奖。
      </p>
      <p>
        <strong>◎大小</strong>
        <br> 开出的号码大于或等于6为大，小于或等于5为小 。</p>
      <p>
        <strong>◎单双</strong>
        <br> 号码为双数叫双，如4、6；号码为单数叫单，如3、5。
      </p>
      <p>
        <strong>◎龙虎</strong>
        <br> 冠军龙虎 * 龙：冠军号码大于第十名号码视为“龙”中奖，如冠军开出07，第十名开出03。
        <br> * 虎：冠军号码小于第十名号码视为“虎”中奖，如冠军开出03，第十名开出07。
        <br> 亚军龙虎 * 龙：亚军号码大于第九名号码视为“龙”中奖，如亚军开出07，第九名开出03。
        <br> * 虎：亚军号码小于第九名号码视为“虎”中奖，如亚军开出03，第九名开出07。
        <br> 季军龙虎 * 龙：季军号码大于第八名号码视为“龙”中奖，如季军开出07，第八名开出03。
        <br> * 虎：季军号码小于第八名号码视为“虎”中奖，如季军开出03，第八名开出07。
        <br> 第四名龙虎 * 龙：第四名号码大于第七名号码视为“龙”中奖，如第四名开出07，第七名开出03。
        <br> * 虎：第四名号码小于第七名号码视为“虎”中奖，如第四名开出03，第七名开出07。
        <br> 第五名龙虎 * 龙：第五名号码大于第六名号码视为“龙”中奖，如第五名开出07，第六名开出03。
        <br> * 虎：第五名号码小于第六名号码视为“虎”中奖，如第五名开出03，第六名开出07。</p>
      <h5>
        <strong>冠亚军和规则说明</strong>
      </h5>
      <p>
        <strong>◎冠亚军和</strong>
        <br> 冠军号码与亚军号码的和值区间为3~19，当投注组合符合冠亚军和值，即视为中奖。
      </p>
      <p>
        <strong>◎冠亚军和大小</strong>
        <br> 当开奖结果冠军号码与亚军号码的和值大于11为大，投注“和大”则视为中奖；小于11为小，投注“和小”则视为中奖；
      </p>
      <p>
        <strong>◎冠亚军和单双</strong>
        <br> 当开奖结果冠军号码与亚军号码的和值为单数如9、13，投注“和单”则视为中奖；为双数如12、16，投注“和双”则视为中奖；
      </p>
    </div>
    <div class="help_col" :class="{'show': tabIdx == 1}">
      <span id="test1"></span>
      <h4>
        <strong>【前一玩法】</strong>
      </h4>
      <p>
        <strong>◎直选复式</strong>
        <br> 从01-10中至少选择1个号码组成一注，所选号码与开奖号码中第一位相同即中奖。
        <br> ※举例 投注方案：01 开奖号码：01 02 03 04 05 06 07 08 09 10即可中前一直选。
      </p>

      <hr>
      <span id="test2"></span>
      <h4>
        <strong>【前二玩法】</strong>
      </h4>
      <p>
        <strong>◎直选复式 </strong>
        <br> 从冠军、亚军位中至少各选择一个号码组成一注，开奖号码中第一、第二位与选号按位相同，即为中奖。
        <br> ※举例：投注方案：冠军01，亚军02 开奖号码：01 02 03 04 05 06 07 08 09 10即可中前二直选。</p>
      <p>
        <strong>◎直选单式 </strong>
        <br> 手动输入两个号码组成一注，所选号码与开奖号码中第一、第二位相同，且顺序一致，即为中奖。
        <br> ※举例：投注方案：0102，开奖号码：01 02 03 04 05 06 07 08 09 10即可中前二直选。</p>

      <hr>
      <span id="test3"></span>
      <h4>
        <strong>【前三玩法】</strong>
      </h4>
      <p>
        <strong>◎直选复式 </strong>
        <br> 从冠军、亚军、季军位中至少各选择一个号码组成一注，开奖号码中第一、第二、第三位与选号按位相同，即为中奖。
        <br> ※举例：投注方案：冠军01，亚军02，季军03 开奖号码：01 02 03 04 05 06 07 08 09 10即可中前三直选。</p>
      <p>
        <strong>◎直选单式 </strong>
        <br> 手动输入两个号码组成一注，所选号码与开奖号码中第一、第二、第三位相同，且顺序一致，即为中奖。
        <br> ※举例：投注方案：010203开奖号码：01 02 03 04 05 06 07 08 09 10即可中前三直选。</p>

      <hr>
      <span id="test4"></span>
      <h4>
        <strong>【定位胆玩法】</strong>
      </h4>
      <p>
        <strong>◎定位胆 </strong>
        <br> 从冠军到第十名任意位置上至少选择1个或1个以上号码，每注由1个号码组成，所选号码与相同位置上的开奖号码一致，即为中奖。
        <br> ※举例：投注方案：冠军01 开奖号码：01 02 03 04 05 06 07 08 09 10即中定位胆。</p>
    </div>
    <div class="help_col" :class="{'show': tabIdx == 2}">
      <h5>
        <strong>开奖说明</strong>
      </h5>
      <p>
        template(v-if="/BJPK10/.test(data.alias)")
          | 开奖时间：每天44期、每20分钟1期；每天早上09点28分至晚上11点48分；
        template(v-else-if="/YFPK10/.test(data.alias)")
          | 开奖时间：每天1440期、每1分钟1期；每天凌晨00点00分至晚上11点59分；
        template(v-else-if="/JSPK10/.test(data.alias)")
          | 开奖时间：每天1440期、每1分钟1期；每天凌晨00点00分至晚上11点59分；
        template(v-else-if="/EFPK10/.test(data.alias)")
          | 开奖时间：每天720期、每2分钟1期；每天凌晨00点00分至晚上11点58分；
        template(v-else-if="/SFPK10/.test(data.alias)")
          | 开奖时间：每天420期、每3分钟1期；每天早上09点03分至次日06点00分；
        template(v-else-if="/WFFT/.test(data.alias)")
          | 开奖时间：每天180期、中午13:07开到凌晨04:02（5分钟一期）；
        template(v-else-if="/XTWFFT/.test(data.alias)")
          | 开奖时间：每天180期、中午13:08开到凌晨04:03（5分钟一期）；
        template(v-else-if="/WFPK10/.test(data.alias)")
          | 开奖时间：每天288期，00:00-23:55（5分钟一期）；
        template(v-else-if="/SHFPK10/.test(data.alias)")
          | 开奖时间：每天144期，00:00-24:00（10分钟一期）；
        <br> 开奖号码：开奖结果为十位。
      </p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'Rules_PK10',
  props: ['data'],
  data() {
    return {
      tabs: ['传统玩法', '官方玩法', '游戏说明'],
      tabIdx: 0,
    };
  },
};
</script>
